from fastapi import FastAPI, HTTPException
from fastapi.middleware.cors import CORSMiddleware

app = FastAPI()

app.add_middleware(
    CORSMiddleware,
    allow_origins=["*"],
    allow_credentials=True,
    allow_methods=["*"],
    allow_headers=["*"],
)

mock_db = {
    "CODE001": {
        "result_type": "Negative",
        "risk_level": "🟢 ต่ำ", 
        "message": "ผลตรวจไม่พบเชื้อไวรัส HPV สายพันธุ์เสี่ยงสูง บริเวณปากมดลูกอยู่ในเกณฑ์ปกติ มีความเสี่ยงต่ำมากในการเกิดมะเร็งปากมดลูกในปัจจุบัน", 
        "advice": [
            "ดูแลสุขภาพทั่วไป รักษาสุขอนามัยของระบบสืบพันธุ์", 
            "เข้ารับการตรวจคัดกรองมะเร็งปากมดลูกซ้ำอีกครั้งในอีก 5 ปี",
            "ใช้ถุงยางอนามัยเมื่อมีความเสี่ยง",
            "หากระหว่างนี้มีอาการผิดปกติ เช่น มีเลือดออกหลังมีเพศสัมพันธ์ เลือดออกผิดปกติทางช่องคลอด หรือตกขาวมีกลิ่นเหม็นผิดปกติ ให้มาพบแพทย์ทันทีโดยไม่ต้องรอครบ 5 ปี"
        ]
    },
    "CODE002": {
        "result_type": "Positive HPV 16 หรือ Positive HPV 18",
        "risk_level": "🔴 สูงมาก",
        "message": "ผลตรวจพบเชื้อ HPV สายพันธุ์ 16 หรือ 18 ซึ่งเป็นกลุ่มที่มีความเสี่ยงสูงที่สุด มีโอกาสพัฒนากลายเป็นมะเร็งปากมดลูก 'การพบเชื้อไม่ได้แปลว่าเป็นมะเร็ง' แต่หมายถึงต้องได้รับการตรวจเช็คช่องคลอดและปากมดลูกอย่างละเอียดเพิ่มเติมด้วยการตรวจส่องกล้องขยายช่องคลอดและตัดชิ้นเนื้อส่งตรวจ (Colposcopy / Biopsy) ที่โรงพยาบาลตามสิทธิการรักษา กรุณามาพบแพทย์ค่ะ",
        "advice": [
            "ทำจิตใจให้สบาย ไม่ต้องตกใจหรือวิตกกังวล การพบเชื้อตั้งแต่ระยะนี้ช่วยให้ป้องกันและรักษาได้ทันก่อนจะพัฒนากลายเป็นโรค",
            "งดสอดใส่ยา งดสวนล้างช่องคลอด และงดมีเพศสัมพันธ์ 24–48 ชั่วโมงก่อนวันนัดตรวจส่องกล้อง"
        ]
    },
    "CODE003": {
        "result_type": "Positive Non 16/18",
        "risk_level": "รอประเมินเพิ่มเติม",
        "message": "ตรวจพบเชื้อ HPV สายพันธุ์เสี่ยงสูงกลุ่มอื่นๆ ซึ่งร่างกายของคนส่วนใหญ่สามารถกำจัดเชื้อชนิดนี้ออกไปได้เองตามธรรมชาติ แต่จำเป็นต้องตรวจเซลล์ปากมดลูกเพิ่มเติม (LBC) เพื่อประเมินแนวทางการรักษาต่อไป",
        "advice": [
            "รอฟังผลตรวจเช็กระดับเซลล์ (LBC) เพิ่มเติมตามที่เจ้าหน้าที่นัดหมาย",
            "พักผ่อนให้เพียงพอ ออกกำลังกายสม่ำเสมอ และรับประทานอาหารที่มีประโยชน์ เพื่อเสริมสร้างภูมิคุ้มกันร่างกายให้ช่วยกำจัดเชื้อ",
            "งดการสูบบุหรี่ (เนื่องจากการสูบบุหรี่ลดภูมิคุ้มกันบริเวณช่องคลอด ทำให้ร่างกายกำจัดเชื้อ HPV ได้ยากขึ้น)"
        ]
    }
}

@app.get("/check-hpv/{code}")
async def check_hpv_result(code: str):
    result = mock_db.get(code.upper())
    if not result:
        raise HTTPException(status_code=404, detail="ไม่พบรหัสประเมินนี้ในระบบ")
    return result